import streamlit as st
import pandas as pd
import numpy as np

st.markdown("# 📚나의 수업 시간표")

data = {
    "시간": ["1교시", "2교시", "3교시"],
    "월": ["성격심", "사과글", ""],
    "화": ["거시", "", "베리타스"],
    "수": ["", "사과글", ""],
    "목": ["", "경통", ""],
    "금": ["컴탐", "회원", ""]
}

df = pd.DataFrame(data)

st.write("### 정적 시간표 (st.table)")
st.table(df)


json_data = {
    "성격심": {"교수": "김수안", "강의실": "101동 210호"},
    "사과글": {"교수": "장슬아", "강의실": "14동 104호"},
    "거시": {"교수": "최재원", "강의실": "223동 107호"},
    "베리타스": {"교수": "이신우, 박연환, 성해영", "강의실": "62동 205호"},
    "경통": {"교수": "류근관", "강의실": "223동 107호"},
    "컴탐": {"교수": "변해선", "강의실": "26동 104호"},
    "회원": {"교수": "서정연", "강의실": "58동 324호"}
}

st.write("### 수업 정보 (st.json)")
st.json(json_data)


st.write("### 이번 학기 요약 (st.metric)")
st.metric(label="수강 과목 수", value="7")
st.metric(label="학점", value="20", delta="+2")
